Core/src/Documents/ВозвратДенегОтПФ/ВозвратДенегОтПФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратДенегОтПФ</name>
  <registerRecords>AccumulationRegister.РасчетыНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияИУдержания</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПерсоналом</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДохода</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗачисленнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗачисленнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ПлановыеНачисленияИУдержания/ПлановыеНачисленияИУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеНачисленияИУдержания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыНачисленийИУдержаний/ТипыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНачисленийИУдержаний</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
  <enumValues>
    <name>Налог</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеПФ</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеДляКонтрагента</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ВозвратДенегОтПФ/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

//Экспортные переменные

//Обычные переменные


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

КонецПроцедуры

&НаСервере
Процедура ОбновитьДополнительныеРеквизиты()
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	ИДСтроки = Элементы.Сотрудники.ТекущаяСтрока;
	ЗаполнитьДанныеСотрудника(ИДСтроки);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеСотрудника(ИДСтроки)
	
	ТекСтрока = Объект.Сотрудники.НайтиПоИдентификатору(ИДСтроки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.СтруктурнаяЕдиница КАК Подразделение,
		|	Сотрудники.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
		|	МАКСИМУМ(ПлановыеНачисленияИУдержания.ВидНачисленияУдержания) КАК ВидРасчета
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
		|				&Дата,
		|				Сотрудник = &Сотрудник
		|					И ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)) КАК ПлановыеНачисленияИУдержания
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.СтруктурнаяЕдиница,
		|	Сотрудники.ВидУдержанияНДФЛ";
	Запрос.УстановитьПараметр("Дата", 				Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	Запрос.УстановитьПараметр("Сотрудник",			ТекСтрока.Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ТекСтрока, Выборка);
		
		СтавкаНДФЛ	= ?(ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ), ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0);
		ТекСтрока.СуммаНДФЛ = (ТекСтрока.ЗачисленнаяСумма * СтавкаНДФЛ / 100) / 2;
		
	Иначе
		ТекСтрока.Подразделение = Неопределено;
		ТекСтрока.ВидУдержанияНДФЛ	= Неопределено;
		ТекСтрока.СуммаНДФЛ		= 0;
		ТекСтрока.ВидРасчета	= Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СотрудникиСтавкаНДФЛПриИзменении(Элемент)
	РасчитатьСуммыТЧ(Элементы.Сотрудники.ТекущаяСтрока);
КонецПроцедуры
&НаКлиенте
Процедура СотрудникиЗачисленнаяСуммаПриИзменении(Элемент)
	РасчитатьСуммыТЧ(Элементы.Сотрудники.ТекущаяСтрока);
КонецПроцедуры
&НаСервере
Процедура РасчитатьСуммыТЧ(ИД, ИмяТЧ = "Сотрудники")
	
	ТекСтрока = Объект[ИмяТЧ].НайтиПоИдентификатору(ИД);
	СтавкаНДФЛ	= ?(ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ), ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0);
	ТекСтрока.СуммаНДФЛ = (ТекСтрока.ЗачисленнаяСумма * СтавкаНДФЛ / 100)/2;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентыКонтрагентПриИзменении(Элемент)
	КонтрагентыКонтрагентПриИзмененииНаСервере(Элементы.Контрагенты.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура КонтрагентыКонтрагентПриИзмененииНаСервере(ИД)
	
	ТекСтрока = Объект.Контрагенты.НайтиПоИдентификатору(ИД);
	ОсновнойДоговорКонтрагента = ТекСтрока.Контрагент.ДоговорПоУмолчанию;
	Если ОсновнойДоговорКонтрагента.УчитыватьНДФЛ Тогда
		ТекСтрока.ДоговорКонтрагента = ОсновнойДоговорКонтрагента;
		ТекСтрока.ВидУдержанияНДФЛ		 = ОсновнойДоговорКонтрагента.ВидУдержанияНДФЛ;
		Если ЗначениеЗаполнено(ТекСтрока.ЗачисленнаяСумма) Тогда
			СтавкаНДФЛ	= ?(ЗначениеЗаполнено(ТекСтрока.ВидУдержанияНДФЛ), ТекСтрока.ВидУдержанияНДФЛ.СтавкаНДФЛ, 0);
			ТекСтрока.СуммаНДФЛ = ТекСтрока.ЗачисленнаяСумма * СтавкаНДФЛ / 100;
		Иначе
			ТекСтрока.СуммаНДФЛ = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыДоговорКонтрагентаПриИзменении(Элемент)
	ТекДанные = Элементы.Контрагенты.ТекущиеДанные;
	ТекДанные.ВидУдержанияНДФЛ = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДанные.ДоговорКонтрагента, "ВидУдержанияНДФЛ");
	РасчитатьСуммыТЧ(ТекДанные.ПолучитьИдентификатор(), "Контрагенты");
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыЗачисленнаяСуммаПриИзменении(Элемент)
	РасчитатьСуммыТЧ(Элементы.Контрагенты.ТекущаяСтрока, "Контрагенты");
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыСтавкаНДФЛПриИзменении(Элемент)
	РасчитатьСуммыТЧ(Элементы.Контрагенты.ТекущаяСтрока, "Контрагенты");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
